-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019 年 09 月 17 日 07:06
-- 伺服器版本： 10.1.40-MariaDB
-- PHP 版本： 7.3.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `cinema`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admin`
--

CREATE TABLE `admin` (
  `id` int(10) UNSIGNED NOT NULL,
  `acc` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `pwd` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `admin`
--

INSERT INTO `admin` (`id`, `acc`, `pwd`) VALUES
(1, 'admin', '1234');

-- --------------------------------------------------------

--
-- 資料表結構 `member_profile`
--

CREATE TABLE `member_profile` (
  `id` int(10) UNSIGNED NOT NULL,
  `acc` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pwd` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` char(20) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `member_profile`
--

INSERT INTO `member_profile` (`id`, `acc`, `name`, `email`, `pwd`, `phone`) VALUES
(1, 'a111111', 'Jason', '123@gmail.com', '111111', '0911111111'),
(2, 'a222222', 'jo', 'rumb6955@yahoo.com.tw', '222222', '0922222222');

-- --------------------------------------------------------

--
-- 資料表結構 `sell`
--

CREATE TABLE `sell` (
  `id` int(10) UNSIGNED NOT NULL,
  `movie` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '電影',
  `date` date NOT NULL COMMENT '日期',
  `time` int(1) NOT NULL COMMENT '時間',
  `many` int(1) NOT NULL COMMENT '訂位數量',
  `seat` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '座位',
  `sir_num` char(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '會員帳號',
  `num` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `sell`
--

INSERT INTO `sell` (`id`, `movie`, `date`, `time`, `many`, `seat`, `sir_num`, `num`) VALUES
(116, '下半場', '2019-09-15', 1, 4, 'a:4:{i:0;s:2:\"41\";i:1;s:2:\"42\";i:2;s:2:\"43\";i:3;s:2:\"44\";}', '', '1568505819'),
(117, '下半場', '2019-09-15', 1, 3, 'a:3:{i:0;s:2:\"45\";i:1;s:2:\"46\";i:2;s:2:\"47\";}', '', '1568506331'),
(118, '下半場', '2019-09-15', 1, 3, 'a:3:{i:0;s:2:\"45\";i:1;s:2:\"46\";i:2;s:2:\"47\";}', '', '1568506477'),
(119, '下半場', '2019-09-15', 1, 2, 'a:2:{i:0;s:2:\"48\";i:1;s:2:\"49\";}', '', '1568506499'),
(120, '下半場', '2019-09-15', 1, 1, 'a:1:{i:0;s:2:\"50\";}', '', '1568506507'),
(121, '下半場', '2019-09-15', 4, 4, 'a:4:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";i:3;s:2:\"52\";}', '', '1568534430'),
(122, '下半場', '2019-09-15', 6, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568543837'),
(123, '下半場', '2019-09-15', 7, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568554492'),
(124, '朵拉與失落的黃金城', '2019-09-15', 7, 4, 'a:4:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";i:3;s:2:\"52\";}', '', '1568555958'),
(125, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568610697'),
(126, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568610734'),
(127, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568611014'),
(128, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568611051'),
(129, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"52\";i:1;s:2:\"53\";i:2;s:2:\"54\";}', '', '1568611132'),
(130, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"55\";i:1;s:2:\"56\";i:2;s:2:\"57\";}', '', '1568611141'),
(131, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"58\";i:1;s:2:\"59\";i:2;s:2:\"60\";}', '', '1568611545'),
(132, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"37\";}', '', '1568611583'),
(133, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"38\";}', '', '1568611694'),
(134, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"39\";}', '', '1568612015'),
(135, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"40\";}', '', '1568612075'),
(136, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"40\";}', '', '1568612260'),
(137, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"41\";i:1;s:2:\"42\";}', '', '1568612267'),
(138, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"41\";i:1;s:2:\"42\";}', '', '1568612273'),
(139, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"43\";i:1;s:2:\"44\";}', '', '1568612280'),
(140, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"43\";i:1;s:2:\"44\";}', '', '1568612288'),
(141, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"45\";}', '', '1568612309'),
(142, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"45\";}', '', '1568612318'),
(143, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"45\";}', '', '1568612330'),
(144, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"45\";}', '', '1568612336'),
(145, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"46\";i:1;s:2:\"47\";}', '', '1568612346'),
(146, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"48\";}', '', '1568612380'),
(147, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"25\";}', '', '1568612408'),
(148, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"26\";}', '', '1568612537'),
(149, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"27\";i:1;s:2:\"28\";i:2;s:2:\"29\";}', '', '1568612608'),
(150, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"30\";}', '', '1568616527'),
(151, '下半場', '2019-09-16', 3, 1, 'a:1:{i:0;s:2:\"30\";}', '', '1568616804'),
(152, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"31\";i:1;s:2:\"32\";i:2;s:2:\"33\";}', '', '1568617232'),
(153, '下半場', '2019-09-16', 3, 3, 'a:3:{i:0;s:2:\"31\";i:1;s:2:\"32\";i:2;s:2:\"33\";}', '', '1568617238'),
(154, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"34\";i:1;s:2:\"35\";}', '', '1568617663'),
(155, '下半場', '2019-09-16', 3, 2, 'a:2:{i:0;s:2:\"34\";i:1;s:2:\"35\";}', '', '1568617675'),
(156, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618095'),
(157, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618105'),
(158, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618610'),
(159, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618618'),
(160, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618712'),
(161, '下半場', '2019-09-16', 3, 4, 'a:4:{i:0;s:2:\"12\";i:1;s:2:\"23\";i:2;s:2:\"24\";i:3;s:2:\"36\";}', '', '1568618718'),
(162, '下半場', '2019-09-16', 7, 4, 'a:4:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";i:3;s:2:\"52\";}', '', '1568638160'),
(163, '下半場', '2019-09-17', 2, 4, 'a:4:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";i:3;s:2:\"52\";}', '', '1568692388'),
(164, '下半場', '2019-09-17', 2, 4, 'a:4:{i:0;s:2:\"53\";i:1;s:2:\"54\";i:2;s:2:\"55\";i:3;s:2:\"56\";}', '', '1568692472'),
(165, '下半場', '2019-09-17', 2, 4, 'a:4:{i:0;s:2:\"53\";i:1;s:2:\"54\";i:2;s:2:\"55\";i:3;s:2:\"56\";}', '', '1568692526'),
(166, '下半場', '2019-09-17', 3, 4, 'a:4:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";i:3;s:2:\"52\";}', '', '1568695614'),
(167, '在黑暗中說的鬼故事', '2019-09-17', 3, 3, 'a:3:{i:0;s:2:\"49\";i:1;s:2:\"50\";i:2;s:2:\"51\";}', '', '1568695671');

-- --------------------------------------------------------

--
-- 資料表結構 `small_movie`
--

CREATE TABLE `small_movie` (
  `id` int(10) UNSIGNED NOT NULL,
  `ch_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `en_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `big_img` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `small_img` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `introduction` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `lan` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `video` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `time` date NOT NULL,
  `display` int(1) NOT NULL,
  `time_length` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `small_movie`
--

INSERT INTO `small_movie` (`id`, `ch_name`, `en_name`, `big_img`, `small_img`, `introduction`, `type`, `lan`, `video`, `time`, `display`, `time_length`) VALUES
(1, '下半場', 'We Are Champions', 'a2.jpg', 'a1.png', '《下半場》以一對相依為命的兄弟，憑藉著對於籃球渴望與夢想來支撐貧苦的日子，但卻因為兩人各自投效不同的隊伍，讓兄弟之間的情感出現變化和摩擦，他們要如何在球場上各自拼搏奔向冠軍之路和化解彼此的心結？ 主要演員：朱軒洋,范少勳', '劇情', '國語', 'Tmy4VdmPGAo', '2019-08-23', 1, '1時57分'),
(2, '朵拉與失落的黃金城', 'Dora And the lost city of gold', 'a3.jpg', 'a1.png', '她一生中大部分時間都在和父母一起探索叢林，卻沒有什麼能讓朵拉（伊莎貝拉莫娜 飾）為她最危險的冒險 - 高中生活做準備。 身為探險家，朵拉將帶領著布茲（她最好的朋友，一隻猴子），迪亞哥（傑佛瑞華伯格 飾），一個神秘的叢林居民（歐亨尼奧德伯茲 飾），還有一群青少年共同參與一場真人實景的冒險旅程。拯救她父母親（麥可潘納和伊娃朗格莉亞 飾）的同時，還要解開失落的黃金城的謎團。', '冒險', '英語', 'e0g_axPUKm4', '2019-08-09', 0, '1時42分'),
(3, '絕世名伶', 'MATHILDE', 'a4.jpg', 'a2.png', '被譽為世界三大芭蕾舞團的馬林斯基劇院芭蕾舞團正在為皇室成員舉行公演，遭人算計的舞伶瑪蒂妲，舞衣在眾人面前掉落了，她卻無懼世俗的眼光繼續完成獨舞。自信、美麗又大膽的她，成功贏得王儲尼古拉二世的心，兩人在神聖的皇家宮殿進行著跨越階級的禁忌之戀。然而一場火車意外，讓俄國沙皇．亞歷山大三世身體狀況急轉直下，尼古拉二世知道，為了人民，他必須在加冕禮上迎娶德國公主，在責任與愛情之間，他必須做出選擇。為了讓他順利登基，母后一方面秘密地派出皇室人馬威脅瑪蒂妲的性命…', '劇情', '英語', 'aRiVUkjyXkE', '2019-08-09', 0, '1時49分'),
(4, '在黑暗中說的鬼故事', 'Scary Stories to Tell in the Dark', 'a5.jpg', 'a3.png', '★全球暢銷700萬冊恐怖小說改編，全世界最多國禁書首次躍上大銀幕！在美國米爾谷小鎮郊外的陰森豪宅內，莎拉將她受盡折磨的人生寫成了一本恐怖故事書。多年後，史黛拉跟她的朋友們來到這棟傳說中的廢棄鬼宅探險，史黛拉發現了故事書並帶回家閱讀，書裡出現了「稻草人哈洛」、「蒼白女」等等各種傳說中的恐怖鬼怪。在她看完第一則故事的隔日，她的朋友湯米竟離奇失蹤，而史黛拉意外發現恐怖故事的主角也叫湯米！一篇篇驚悚駭人的鬼故事開始逐漸成真…', '恐怖', '英語', 'inF4IPezJHY', '2019-08-07', 0, '1時47分'),
(5, '痛苦與榮耀', 'PAIN AND GLORY', 'a6.jpg', 'a4.png', '國際大導演阿莫多瓦聯手影帝后，再創生涯巔峰之作 ！年事已高的電影導演馬洛已屆創作靈感的邊緣，飽受疾病折磨的同時也讓他不得不用藥壓抑痛苦。面對現在的狼狽，馬洛回想起1960年他的家人是怎麼從家鄉移民到西班牙小鎮，母親（在狹窄的房子點亮他對未來的希望；1980年他在馬德里與初戀相遇而後分開，寫作成為失戀痛苦的排解，意外為他開啟電影的世界！這是阿莫多瓦獻給自己的故事，也是獻給所有在人生中掙扎的每一個人的故事。', '劇情', '英語', 'NEucepAPUL8', '2019-08-02', 0, '1時53分'),
(6, '玩命關頭：特別行動', 'Fast & Furious: Hobbs & Shaw', 'a7.jpg', 'a3.png', '自從大隻佬執法人員哈柏，一名美國探員，以及不法之徒戴克蕭，一名前任英國軍方特種部隊士兵，首次在《玩命關頭7》針鋒相對後，這對死對頭就一直試圖把對方打趴。但當一名經過電腦生化基因改造並增強體能的無政府主義者布列斯頓掌握了一項對人類造成傷害的生化威脅，並且打敗了聰明絕頂的叛變軍情六處探員，而她正好是戴克蕭的妹妹海蒂蕭，這一對本來勢不兩立的死對頭就必須攜手合作、聯手出擊，擊敗一個比他們更狠的狠角色。', '動作', '英語', 'dKX2r-1IlJM', '2019-07-31', 0, '2時15分'),
(7, '出走巴黎', 'Synonyms', 'a8.jpg', 'a1.png', '獲69屆柏林影展金熊獎，柏林影展國際影評人費比西獎。講述一名男子從以色列逃到巴黎，由於過去造成他巨大的精神創痛，讓他徹底拒絕使用自己的母語，他僅靠著一本字典將之視為進入巴黎的敲門磚。', '劇情', '英語', 'gSlMYBIABPw', '2019-07-26', 0, '2時3分'),
(8, '從前，有個好萊塢', 'Once Upon a Time in Hollywood', 'a9.jpg', 'a3.png', '大導昆汀塔倫提諾的最新強片！故事在1969年瞬息萬變的洛杉磯展開，電視明星瑞克達爾頓與他長期合作替身搭檔克里夫布茲如何在逐漸陌生的娛樂圈裡，找到自己的一席之地。昆汀塔倫提諾第九部編劇導演電影，匯集星光閃閃的卡司與交錯的情節，紀念好萊塢不再復返的黃金年代。', '喜劇', '英語', '0eS5IjPscn8', '2019-07-24', 0, '2時42分'),
(9, '電流大戰', 'The Current War', 'a10.jpg', 'a2.png', '★《奇異博士》班尼狄克康柏拜區X《X戰警》尼可拉斯霍特X《蜘蛛人：返校日》湯姆霍蘭德！掌握電的人，就掌握了未來！19世紀，湯瑪斯愛迪生點亮電燈，驚艷世界，並認為直流電才是最合適的供電系統，受雇於他的特斯拉設計了交流電力系統，二人各執一方，特斯拉憤而投入喬治威斯汀豪斯創辦的西屋電氣公司。愛迪生和威斯汀豪斯各自擁護直流電和交流電，供電市場的巨大利益衝突、勾心鬥角的商業算計，這場激烈的電流爭霸戰注定改變世界，究竟誰才能實現心目中的光電帝國呢？', '劇情', '英語', '3LLRKJlWVXo', '2019-07-19', 0, '1時57分'),
(10, '全面攻佔3：天使救援', 'Angel Has Fallen', 'a11.jpg', 'a3.png', '這次恐怖分子頭號目標，竟是最強特務-麥克班寧！《全面攻佔3：天使救援》故事時間設定在倫敦淪陷的兩年後，當年的副總統-艾倫已經變成美國總統，麥克班寧晉升為特勤局局長。恐怖份子這次盯上麥克，陷害他成為謀殺總統的通緝犯，被全球通緝！麥克為了證明自己的清白，為了保護家人與總統，找上許久未見的父親結盟，揪出敵人並洗刷自己的汙名！', '動作', '英語', 'MnhKqEPwSbA', '2019-08-21', 0, '2時0分'),
(11, '雙面特務', 'The Operative', 'a12.jpg', 'a2.png', '故事發生在21世紀初，國際情勢爾虞我詐，戰爭隨時一觸即發。瑞秋因為優異的天分及語言能力，被以色列特務組織相中，送往伊朗進行臥底，佯裝成無害的英文老師，接近神秘的目標法哈德，以了解更多核武計畫的內容。然而，就在任務即將宣告終結的關鍵時刻，瑞秋卻離奇失蹤了，除了一通打給搭檔湯瑪士（馬丁費里曼 飾）的神秘電話，什麼也沒留下。湯瑪士必須想盡辦法找出瑞秋的下落，還要設法保護組織、甚至國家的安全不受到牽連…...', '驚悚', '英語', 'nr3pAIcwESo', '2019-09-30', 0, '1時56分'),
(12, '使徒行者2', 'Line Walker2', 'a13.jpg', 'a1.png', '香港鬧市發生嚴重交通意外，刑事情報科警司葉國帆和總督察程滔逮捕一名女駭客姚可儀。保安部警司井進賢認為葉國帆和程滔的逮捕行為非常可疑，向警務處處長要求禁止兩人插手案件。調查範圍擴展到緬甸和西班牙，井進賢和程滔在多次的合作中產生矛盾，而在葉國帆的眼裡，這兩個人忠奸難分，警界高層則是認為葉國帆顛倒黑白，懷疑大量黑警滲入警隊多時，需深入某神秘組織調查事件。可是，警隊內人人皆有可疑，從女駭客的口供裡也帶著誤導性，警隊高層更覺得霧裡看花，不曉得誰正誰邪……', '警匪', '奧語', 'GnrMtG98yZM', '2019-08-30', 0, '1時38分');

-- --------------------------------------------------------

--
-- 資料表結構 `ticket_sell`
--

CREATE TABLE `ticket_sell` (
  `id` int(11) UNSIGNED NOT NULL,
  `movie` int(11) NOT NULL,
  `date` date NOT NULL,
  `time` int(11) NOT NULL,
  `many` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `ticket_sell`
--

INSERT INTO `ticket_sell` (`id`, `movie`, `date`, `time`, `many`) VALUES
(1, 1, '2019-08-29', 1, 4),
(2, 1, '2019-08-29', 1, 2),
(3, 1, '2019-08-29', 2, 1),
(4, 1, '2019-09-01', 2, 3),
(5, 1, '2019-09-02', 3, 1),
(6, 1, '2019-09-03', 3, 2),
(7, 1, '2019-09-04', 4, 3),
(8, 1, '2019-09-05', 4, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `web1_register`
--

CREATE TABLE `web1_register` (
  `id` int(10) UNSIGNED NOT NULL,
  `acc` varchar(8) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pwd` varchar(13) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tel` char(14) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `web1_register`
--

INSERT INTO `web1_register` (`id`, `acc`, `pwd`, `email`, `tel`) VALUES
(1, 'a111', 'a111', 'a111@gmail.com', 'a111'),
(2, 'a222222', '222222', '123@gmail.com', '9999999999'),
(3, 'a333333', '333333', '123@gmail.com', '333333');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `member_profile`
--
ALTER TABLE `member_profile`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `sell`
--
ALTER TABLE `sell`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `small_movie`
--
ALTER TABLE `small_movie`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `ticket_sell`
--
ALTER TABLE `ticket_sell`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `web1_register`
--
ALTER TABLE `web1_register`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `member_profile`
--
ALTER TABLE `member_profile`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `sell`
--
ALTER TABLE `sell`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `small_movie`
--
ALTER TABLE `small_movie`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `ticket_sell`
--
ALTER TABLE `ticket_sell`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `web1_register`
--
ALTER TABLE `web1_register`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
